# DeletingDPartWillDeleteMorePartsError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DeletingDPartWillDeleteMorePartsError Property
BuiltInFailures..::..DPartFailures Class See Also
---
Deleting a Part will delete all associated Parts and the original Element will be made visible.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeletingDPartWillDeleteMorePartsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeletingDPartWillDeleteMorePartsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeletingDPartWillDeleteMorePartsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace